app/views/users/show.html.erb

SELECT  "bikes".* FROM "bikes" WHERE "bikes"."user_id" = ?  ORDER BY "bikes"."id" ASC LIMIT 1  [["user_id", 1]]
---
      <div class="jumbotron">
        <h1 class="manage_bike">Welcome <%= current_user.first_name %>! </h1>