app/controllers/tasks_controller.rb

  def new
    p "tasks#new"
    @address = Address.new
    @bike = current_user.bikes.first
---
SELECT  "bikes".* FROM "bikes" WHERE "bikes"."user_id" = ?  ORDER BY "bikes"."id" ASC LIMIT 1  [["user_id", 1]]

  def create
    @task = Task.new(user_id:         current_user.id,
                     pickup_address:  "33 Montclair Terrace, San Francisco, CA 94109",
                     dropoff_address: "#{params[:street]},#{params[:city]}, #{params[:state]}, #{params[:zip_code]}",
                     status:          "initial" )
    if @task
      @task.save!
    end

    api = Postmates::Client.new

    #Get a Quote
    quote_response = api.create_delivery_quote( { dropoff_address: @task.dropoff_address, pickup_address: @task.pickup_address } )
    @task.quote_id = quote_response["id"]

    #Create a Delivery
    @user = User.find(current_user.id)
    @bike = @user.bikes.first

    pickup = "00:00:00"
    pickup_complete = "00:00:01"
    pickup_dropoff = "00:00:05"
    pickup_delivered = "00:00:45"

    delivery_hash = {
      manifest:             "#{@bike.color} #{@bike.make}",
      pickup_name:          "Bike Ready, Inc.",
      pickup_address:       @task.pickup_address,
      pickup_phone_number:  "415-555-1212",
      pickup_notes:         "Fragile",
      dropoff_name:         current_user.first_name,
      dropoff_address:      @task.dropoff_address,
      dropoff_phone_number: current_user.phone,
      quote_id:             @task.quote_id,
      robo_pickup:          pickup,
      robo_pickup_complete: pickup_complete,
      robo_dropoff:         pickup_dropoff,
      robo_delivered:       pickup_delivered
---
INSERT INTO "tasks" ("user_id", "pickup_address", "dropoff_address", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
SELECT  "bikes".* FROM "bikes" WHERE "bikes"."user_id" = ?  ORDER BY "bikes"."id" ASC LIMIT 1  [["user_id", 1]]
SELECT  "users".* FROM "users"  ORDER BY "users"."id" ASC LIMIT 1
SELECT  "tasks".* FROM "tasks"  ORDER BY "tasks"."id" DESC LIMIT 1

    @task.pickup_lat_lng = JSON.generate(delivery_response["pickup"]["location"])
    @task.status = delivery_response["status"]

    @task.save!
    @bike.status = @task.status
    @bike.save!
---
UPDATE "tasks" SET "quote_id" = ?, "delivery_id" = ?, "status" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["quote_id", "dqt_KLe6_o3PAHSg4F"], ["delivery_id", "del_KLe6_nxMNogrqk"], ["status", "pending"], ["updated_at", "2015-05-31 04:01:27.894660"], ["id", 15]]
UPDATE "bikes" SET "status" = ?, "updated_at" = ? WHERE "bikes"."id" = ?  [["status", "pending"], ["updated_at", "2015-05-31 04:11:30.093142"], ["id", 1]]