app/controllers/users_controller.rb

  def show
    @user = current_user
    @bike = current_user.bikes.first

    #get bike status
    if (@bike && @bike.status != 'storage' && @bike.status != 'delivered')
      api = Postmates::Client.new
      @task = Task.where(user_id: current_user.id).last
      del_status_response = api.delivery_status(@task.delivery_id)
      @bike.status = del_status_response["status"]
      @bike.save!
---
SELECT  "bikes".* FROM "bikes" WHERE "bikes"."user_id" = ?  ORDER BY "bikes"."id" ASC LIMIT 1  [["user_id", 1]]
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1  ORDER BY "tasks"."id" DESC LIMIT 1  [["user_id", 1]]
UPDATE "bikes" SET "status" = $1, "updated_at" = $2 WHERE "bikes"."id" = $3  [["status", "delivered"], ["updated_at", "2015-06-01 19:48:40.065746"], ["id", 1]]